billing_cf/Documents/энргСобытие.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>энргСобытие</Name>
			<Posting>Deny</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.энргСобытия</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ТипСобытия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргСпособСвязи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекстШаблона</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТемаСобытия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПланируемаяДатаОтправки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МакетПечатнойФормы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Одинарный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СудСудебныйУчастокДляСА</Name>
					<Comment>Реквизит для судебного акта</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.энргСуды</v8:Type>
						<v8:Type>cfg:CatalogRef.энргСудебныеУчастки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СудебнаяИнстанцияДляСА</Name>
					<Comment>Реквизит для судебного акта</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.энргСудебныеИнстанции</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СудьяДляСА</Name>
					<Comment>Реквизит для судебного акта</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.энргКонтрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СудебныйАктДляСА</Name>
					<Comment>Реквизит для судебного акта</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.энргСтатусыСудебногоАкта</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерСудебногоАктаДляСА</Name>
					<Comment>Реквизит для судебного акта</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСудебногоАктаДляСА</Name>
					<Comment>Реквизит для судебного акта</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаВступленияВЗаконнуюСилуДляСА</Name>
					<Comment>Реквизит для судебного акта</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипОтветственностиДляСА</Name>
					<Comment>Реквизит для судебного акта</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.энргИсполнительнаяОтветственностьПИР</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Примечание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособОтправки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргСпособыОтправкиУведомлений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВРамкахЭтапа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргВидыОперацийПИД</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргЗоныОтвественности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Согласующий</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Абоненты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Абонент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.энргАбоненты</v8:Type>
								<v8:Type>cfg:CatalogRef.энргДоговорыКонтрагентов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Основание</Name>
							<Type>
								<v8:Type>cfg:TaskRef.энргЗадачаПИД</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Успех</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Результат</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>500</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Статус</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>IDЭтапа</Name>
							<Type>
								<v8:Type>v8:UUID</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Параметры</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Параметр</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.бестПараметрыТиповСобытий</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.бестПараметрыТиповСобытий</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ПросуженнаяЗадолженность</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Потребитель</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.энргАбоненты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Задолженность</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаПени</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаГоспошлин</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПериодНачисления</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Прочие</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

billing_cf/Documents/энргСобытие/Forms/ФормаДокумента/Ext/Form/Module.bsl
#Область СобытияФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Перем СписокПолучателей, Подэтапы;
	
	энргРаботаСПрикрепленнымиФайламиСервер.ПриСозданииНаСервере(ЭтотОбъект);
	
	НеУчитоватьСв	= "";
	Если Параметры.Свойство("Абоненты", СписокПолучателей) Тогда
		НеУчитоватьСв = "Абоненты";
	 	Для каждого ТекСтрока Из СписокПолучателей Цикл
			СтрокаТЧ = Объект.Абоненты.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаТЧ, ТекСтрока);
		КонецЦикла;
	ИначеЕсли Параметры.Свойство("Договоры", СписокПолучателей) Тогда 
		Для каждого ТекСтрока Из СписокПолучателей Цикл
			СтрокаТЧ = Объект.Абоненты.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаТЧ, ТекСтрока);
		КонецЦикла;
	КонецЕсли;
		
	ЗаполнитьЗначенияСвойств(Объект, Параметры,, НеУчитоватьСв);
	
	// Заполнение таблицы подэтапами задачи
	Если Объект.Одинарный Тогда
		Если ЗначениеЗаполнено(Объект.Абоненты) Тогда
			СтрокаПолучателя = Объект.Абоненты[0];
		Иначе 
			СтрокаПолучателя = Объект.Абоненты.Добавить();
			
			ЗаполнитьЗначенияСвойств(СтрокаПолучателя, Параметры); 
		КонецЕсли;
		
		IDЭтапа 	= СтрокаПолучателя.IDЭтапа;
		Выполнен 	= СтрокаПолучателя.Успех;
		Основание 	= СтрокаПолучателя.Основание;
		Получатель 	= СтрокаПолучателя.Абонент;
		Результат	= СтрокаПолучателя.Результат;
		Если ЗначениеЗаполнено(Основание) Тогда
			Этап 	= Основание.Этап;
		КонецЕсли;
		
		Если Параметры.Свойство("Подэтапы", Подэтапы) Тогда
			
		ИначеЕсли ЗначениеЗаполнено(Основание) Тогда 
			Подэтапы = Документы.энргСобытие.ПолучитьПодэтапыЗадачи(Основание);
		Иначе
			Подэтапы = Новый Массив;
		КонецЕсли;

		Для каждого ТекПодэтап Из Подэтапы Цикл
			СтрокаТЗ = ПодэтапыЗадачи.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаТЗ, ТекПодэтап);
			
			Если ТекПодэтап.IDЭтапа = IDЭтапа Тогда
				Подэтап = ТекПодэтап.Подэтап;
			КонецЕсли;
		КонецЦикла;
		
		Если Объект.Ссылка.Пустая() Тогда
		
			Элементы.Параметры.ИзменятьСоставСтрок		= Истина;
			Элементы.ПараметрыПараметр.ТолькоПросмотр 	= Ложь;
		
		КонецЕсли;
	КонецЕсли;
	
	Справочники.энргШаблоныСообщений.ДобавлениеКомандПараметров(ЭтаФорма, "КомандыПараметрыТемы", "КомТемы", "ВставитьПараметр");
	Справочники.энргШаблоныСообщений.ДобавлениеКомандПараметров(ЭтаФорма, "КомандыПараметрыТекста", "КомТекста", "ВставитьПараметр");
	
	Элементы.МакетПечатнойФормы.СписокВыбора.Очистить();
	СписокМакетов = Справочники.энргВидыОперацийПИД.ПолучитьСписокМакетовПечати();
	Элементы.МакетПечатнойФормы.СписокВыбора.Добавить("", "Нет");
	Для каждого ТекЭлем Из СписокМакетов Цикл
		Элементы.МакетПечатнойФормы.СписокВыбора.Добавить(ТекЭлем.Значение, ТекЭлем.Представление);
	КонецЦикла;
	
	// ВводНаОсновании
	ВводНаОсновании.ПриСозданииНаСервере(ЭтотОбъект, Элементы.ПодменюСоздатьНаОсновании);
	// Конец ВводНаОсновании
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПараметрыРазмещения = ПодключаемыеКоманды.ПараметрыРазмещения();
	ПараметрыРазмещения.КоманднаяПанель = Элементы.ПодменюОтчеты;
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект, ПараметрыРазмещения);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды 
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	УстановитьВидимость();
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	//энргРаботаСПрикрепленнымиФайламиКлиент.ПередЗаписью(Отказ, ЭтотОбъект);
	
	Если Объект.Одинарный Тогда
	
		ПерваяСтрока = Объект.Абоненты[0];
		
		ПерваяСтрока.Абонент 	= Получатель;
		ПерваяСтрока.Основание 	= Основание;
		ПерваяСтрока.Успех 		= Выполнен;
		ПерваяСтрока.Результат 	= Результат;
		ПерваяСтрока.IDЭтапа	= IDЭтапа;
	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	энргРаботаСПрикрепленнымиФайламиКлиент.ПослеЗаписи(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура УстановитьФлажки(Команда)
	УстановитьФлагВсем(Истина);
КонецПроцедуры

&НаКлиенте
Процедура СнятьФлажки(Команда)
	УстановитьФлагВсем(Ложь);
КонецПроцедуры

#КонецОбласти

#Область СобытияЭлементовФормы
&НаКлиенте
Процедура ТемаСобытияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ОткрытьФорму("Справочник.энргШаблоныСообщений.ФормаВыбора",, Элемент);
КонецПроцедуры

&НаКлиенте
Процедура ТемаСобытияОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	
	Если ЗначениеЗаполнено(ВыбранноеЗначение) Тогда
		Объект.ТемаСобытия = энргОбщегоНазначения.ЗначениеРеквизитаОбъекта(ВыбранноеЗначение, "ТекстШаблона"); 
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ТекстШаблонаОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	
	Если ЗначениеЗаполнено(ВыбранноеЗначение) Тогда
		Объект.ТекстШаблона = энргОбщегоНазначения.ЗначениеРеквизитаОбъекта(ВыбранноеЗначение, "ТекстШаблона"); 
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ТипСобытияПриИзменении(Элемент)
	УстановитьВидимость();
	
	ЗаполнитьПараметрыНаСервере();
		
КонецПроцедуры

&НаКлиенте
Процедура АбонентыОснованиеПриИзменении(Элемент)
	ТекСтрока = Элементы.Абоненты.ТекущиеДанные;
	Если ТекСтрока = Неопределено Или Не ЗначениеЗаполнено(ТекСтрока.Основание) Тогда
		Возврат;
	КонецЕсли;
	
	ТекСтрока.Абонент = энргОбщегоНазначения.ЗначениеРеквизитаОбъекта(ТекСтрока.Основание, "Абонент");
КонецПроцедуры

&НаКлиенте
Процедура МакетПечатнойФормыПриИзменении(Элемент)
	УстановитьВидимость();
КонецПроцедуры

&НаКлиенте
Процедура ШагНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	
	Подэтапы = Новый Массив;
	Для каждого СтрокаТЗ Из ПодэтапыЗадачи Цикл
		СтрокаМассива = Новый Структура("IDЭтапа, Подэтап, Текущий, Выполнен, Отменен");
		ЗаполнитьЗначенияСвойств(СтрокаМассива, СтрокаТЗ);
		Подэтапы.Добавить(СтрокаМассива);
	КонецЦикла;
	
	ПарамФормы = Новый Структура("Подэтапы, IDЭтапа", Подэтапы, IDЭтапа);
	
	ОписОпов = Новый ОписаниеОповещения("ОбработкаВыбораЭтапа", ЭтотОбъект);
	ОткрытьФорму("Документ.энргСобытие.Форма.ФормаВыбораПодэтапа", ПарамФормы, Элемент,,,, ОписОпов, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

//&НаКлиенте
//Процедура ШагОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
//	// Вставить содержимое обработчика.
//КонецПроцедуры

#КонецОбласти

#Область ДействияКоманд
&НаКлиенте
Процедура ВставитьПараметр(Команда)
	Если Лев(Команда.Имя, 7) = "КомТемы" Тогда
		Элемент = Элементы.ТемаСобытия;
	Иначе
		Элемент = Элементы.ТекстШаблона;
	КонецЕсли;
	
	Элемент.ВыделенныйТекст = ВставитьПараметрНаСервере(Команда.Имя);
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьШаблон(Команда)
	ОткрытьФорму("Справочник.энргШаблоныСообщений.ФормаВыбора",, Элементы.ТекстШаблона);
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьСобытие(Команда)
	НедостаточноФайлов = Ложь;
	энргРаботаСПрикрепленнымиФайламиКлиент.ПередЗаписью(НедостаточноФайлов, ЭтотОбъект);
	Если НедостаточноФайлов Тогда
		Возврат;
	КонецЕсли;
	СписокВыделенныхСтрок = Новый Массив;
	Для каждого СтрокаТЧ Из Объект.Абоненты Цикл
		Если СтрокаТЧ.Флаг Или Объект.Одинарный Тогда
			СписокВыделенныхСтрок.Добавить(СтрокаТЧ.НомерСтроки);
		КонецЕсли;
	КонецЦикла;
	
	Записать();
	ВыполнениеСобытий(СписокВыделенныхСтрок);
	
	УстановитьВидимость();
КонецПроцедуры

&НаКлиенте
Процедура ОтметитьНеОтправленные(Команда)
	Для каждого СтрокаТЧ Из Объект.Абоненты Цикл
	    СтрокаТЧ.Флаг = Не СтрокаТЧ.Успех;
	КонецЦикла;
КонецПроцедуры
#КонецОбласти

#Область ВспомогательныеФункции
&НаКлиенте
Процедура УстановитьВидимость()
	Элементы.ГруппаОдинарный.Видимость 			= Объект.Одинарный;
	Элементы.ГруппаМножественный.Видимость 		= Не Объект.Одинарный;
	Элементы.Шаг.Видимость						= ЗначениеЗаполнено(ПодэтапыЗадачи);
	Элементы.Организация.ТолькоПросмотр			= Не Объект.Одинарный;
	
	Элементы.ФормаПечатьЗаявленияОВынесенииСудебногоПриказа.Видимость 	= Объект.ТипСобытия = ПредопределенноеЗначение("Справочник.энргСпособСвязи.ФормированиеЗаявленияОВыдачеСудебногоПриказа");
	Элементы.ФормаПечатьФормированиеЗаявления.Видимость 				= Объект.ТипСобытия = ПредопределенноеЗначение("Справочник.энргСпособСвязи.ФормированиеЗаявленияОВынесенииИсполнительногоДокумента");
	
	ЕстьОтправка = ЭтоСобытиеСОтправкой(Объект.ТипСобытия);
	
	Элементы.ГруппаЭлементыОтправки.Видимость 	= ЕстьОтправка;
	Элементы.ФормаВыполнитьСобытие.Видимость 	= ЕстьОтправка;
	Элементы.КнопкиФлага.Видимость 				= ЕстьОтправка;
	Элементы.АбонентыФлаг.Видимость 			= ЕстьОтправка;
	Элементы.ПланируемаяДатаОтправки.Видимость 	= ЕстьОтправка;
	Элементы.Выполнен.ТолькоПросмотр			= ЕстьОтправка;
	Элементы.Результат.ТолькоПросмотр			= ЕстьОтправка;
	
	Если ЕстьОтправка Тогда
		ЭтоОтправкаЭП = Объект.ТипСобытия = ПредопределенноеЗначение("Справочник.энргСпособСвязи.ОтправкаПисьмаНаЭлектроннуюПочту");
		Элементы.ГруппаТема.Видимость		  = ЭтоОтправкаЭП;
		Элементы.МакетПечатнойФормы.Видимость = ЭтоОтправкаЭП;
		Элементы.ГруппаСообщение.Видимость	  = Не ЭтоОтправкаЭП ИЛИ Не ЗначениеЗаполнено(Объект.МакетПечатнойФормы);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ВставитьПараметрНаСервере(ИмяКоманды)
	Префикс = ?(Лев(ИмяКоманды, 7) = "КомТемы", "КомТемы", "КомТекста");
	Возврат Справочники.энргШаблоныСообщений.ЗаменаКоманды(ИмяКоманды, Префикс); 
КонецФункции

&НаКлиенте
Процедура УстановитьФлагВсем(ЗначФлага)
	Для каждого СтрокаТЧ Из Объект.Абоненты Цикл
	    СтрокаТЧ.Флаг = ЗначФлага;
	КонецЦикла;	
КонецПроцедуры

&НаСервере
Процедура ВыполнениеСобытий(СписокВыделенныхСтрок)

	ОбъектДок = РеквизитФормыВЗначение("Объект");
	ОбъектДок.ВыполнитьСобытия(СписокВыделенныхСтрок);

	ЗначениеВРеквизитФормы(ОбъектДок, "Объект");

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПараметрыНаСервере()

	ЗначПарам = Новый Соответствие;
	
	Для каждого СтрокаТЧ Из Объект.Параметры Цикл
		ЗначПарам.Вставить(СтрокаТЧ.Параметр, СтрокаТЧ.Значение);
	КонецЦикла;
	
	Объект.Параметры.Очистить();
	
	СписокПараметровТипа = Справочники.энргСпособСвязи.ПолучитьСписокПараметров(Объект.ТипСобытия);
	
	Для каждого Параметр Из СписокПараметровТипа Цикл
		
		Если ЗначениеЗаполнено(Параметр) Тогда
			СтрокаТЧ = Объект.Параметры.Добавить();
			
			СтрокаТЧ.Параметр = Параметр;
			
			Если Параметр = ПланыВидовХарактеристик.бестПараметрыТиповСобытий.ТелефонАбонента И Объект.Одинарный И ЗначениеЗаполнено(Объект.Абоненты) Тогда
				
				СтрокаТЧ.Значение = Документы.энргСобытие.ПолучитьТелефонАбонента(Объект.Абоненты[0].Абонент, Истина);
			ИначеЕсли  Параметр = ПланыВидовХарактеристик.бестПараметрыТиповСобытий.АдресЭлектроннойПочты И Объект.Одинарный И ЗначениеЗаполнено(Объект.Абоненты) Тогда
				
				СтрокаТЧ.Значение = Документы.энргСобытие.ПолучитьЭлектроннуюПочтуАбонента(Объект.Абоненты[0].Абонент);
			//++
			ИначеЕсли Параметр = ПланыВидовХарактеристик.бестПараметрыТиповСобытий.Суд_СудебныйУчасток Тогда
				
				СтрокаТч.Значение = СудебноеУчреждение(Объект.Абоненты[0].Основание);
						    
			Иначе
				
				Значение		  = ЗначПарам.Получить(Параметр);
				Если Значение <> Неопределено Тогда
					СтрокаТЧ.Значение = Значение;
				КонецЕсли;
				
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;

КонецПроцедуры 

#КонецОбласти

#Область ОбработчикиКомандФормы

// ВводНаОсновании
&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуСоздатьНаОсновании(Команда)
	
	ВводНаОснованииКлиент.ВыполнитьПодключаемуюКомандуСоздатьНаОсновании(Команда, ЭтотОбъект, Объект);
	
КонецПроцедуры
// Конец ВводНаОсновании

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	МодульПодключаемыеКомандыКлиент = ОбщегоНазначенияКлиент.ОбщийМодуль("ПодключаемыеКомандыКлиент");
	МодульПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат)
	МодульПодключаемыеКоманды = ОбщегоНазначения.ОбщийМодуль("ПодключаемыеКоманды");
	МодульПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	МодульПодключаемыеКомандыКлиентСервер = ОбщегоНазначенияКлиент.ОбщийМодуль("ПодключаемыеКомандыКлиентСервер");
	МодульПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры

&НаСервереБезКонтекста
Функция ЭтоСобытиеСОтправкой(ТипСобытия)

	Возврат Документы.энргСобытие.ЭтоСобытиеСОтправкой(ТипСобытия);

КонецФункции 

&НаКлиенте
Процедура ОбработкаВыбораЭтапа(Результат, ДополнительныеПараметры) Экспорт
	Если ТипЗнч(Результат) = Тип("Структура") Тогда
	
		Результат.Свойство("IDЭтапа", IDЭтапа);
		Результат.Свойство("Подэтап", Подэтап);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	Оповестить("ОбновитьСобытия");
КонецПроцедуры

&НаСервере
Функция ПечатьЗаявленияОВынесенииСудебногоПриказаНаСервере(ВидСудопроизводства)
	Если ВидСудопроизводства = Перечисления.энргВидыСудопроизводства.ПриказноеПроизводство Тогда
		ДвоичныеДанные 	= УправлениеПечатью.МакетПечатнойФормы("Документ.энргСобытие.ПФ_DOC_ЗаявлениеОВынесенииСудебногоПриказа");
		//ДвоичныеДанные 	= УправлениеПечатью.МакетПечатнойФормы("Документ.СогласиеНаОбработкуПерсональныхДанных.ПФ_DOC_СогласиеНаОбработкуПерсональныхДанных");
		Адрес			= ПоместитьВоВременноеХранилище(ДвоичныеДанные, ЭтаФорма.УникальныйИдентификатор);
	ИначеЕсли ВидСудопроизводства = Перечисления.энргВидыСудопроизводства.ИсковоеПроизводство Тогда	
		
		ДвоичныеДанные 	= УправлениеПечатью.МакетПечатнойФормы("Документ.энргСобытие.ПФ_DOC_Исковое_заявление");
		//ДвоичныеДанные 	= УправлениеПечатью.МакетПечатнойФормы("Документ.СогласиеНаОбработкуПерсональныхДанных.ПФ_DOC_СогласиеНаОбработкуПерсональныхДанных");
		Адрес			= ПоместитьВоВременноеХранилище(ДвоичныеДанные, ЭтаФорма.УникальныйИдентификатор);
				
	Иначе
		Адрес = Неопределено;
	КонецЕсли;
	
	Возврат Адрес;
КонецФункции

&НаКлиенте
Процедура ПечатьЗаявленияОВынесенииСудебногоПриказа(Команда)
	
	//Адрес = ПечатьЗаявленияОВынесенииСудебногоПриказаНаСервере();
	//ДвоичныеДанныеМакета = ПолучитьИзВременногоХранилища(Адрес);
	
	//Макет = УправлениеПечатьюMSWordКлиент.ПолучитьМакетMSWord(ДвоичныеДанныеМакета, "Заявление о возбуждении исполнительного производства");
	//////Макет = УправлениеПечатьюMSWordКлиент.ПолучитьМакетMSWord(ДвоичныеДанныеМакета, ПолучитьИмяВременногоФайла("doc"));
	//////Handler = УправлениеПечатьюMSWordКлиент.ИнициализироватьПечатнуюФормуMSWord(Макет);
	//////Область = УправлениеПечатьюMSWordКлиент.ПолучитьОбластьМакетаMSWord(Handler, "Заголовок");
	//////
	//////
	////////ИдентификаторОбласти = "{/v8 Область." + ИдентификаторОбласти + "}";
	//////
	////////ВесьДокумент = COMСоединение.ActiveDocument.Content;
	////////ВесьДокумент.Select();
	//////
	//////Поиск = Handler.COMСоединение.Selection.Find;
	//////Поиск.Text = "Заголовок";
	//////Поиск.ClearFormatting();
	//////Поиск.Forward = Истина;
	//////Поиск.execute();
	//УправлениеПечатьюMSWordКлиент.ПоказатьДокументMSWord(Handler);
	
	Для каждого ТекСтрокаТЧ Из Объект.Абоненты Цикл
		Если Не ЗначениеЗаполнено(ТекСтрокаТЧ.Основание) Тогда
			Продолжить;
		КонецЕсли;
		
		ДанныеДляПечати = ПолучитьПараметрыПечатиЗаявлениеОВынесенииСудебногоПриказа(ТекСтрокаТЧ.Основание);
		ДанныеДляПечати = ДополнитьИнформациейОСуде(Объект.Ссылка,ДанныеДляПечати);
		
		Адрес = ПечатьЗаявленияОВынесенииСудебногоПриказаНаСервере(ДанныеДляПечати.ВидСудопроизводства);
		
		Если Адрес = Неопределено Тогда
			Продолжить;
		КонецЕсли;
			
		ДвоичныеДанныеМакета = ПолучитьИзВременногоХранилища(Адрес);
		
		#Если ВебКлиент Тогда
			ВременныйКаталог 	= УправлениеПечатьюСлужебныйКлиент.СоздатьВременныйКаталог("MSWord");
			ИмяВременногоФайла 	= ВременныйКаталог + Строка(Новый УникальныйИдентификатор) + ".tmp";
		#Иначе
			ИмяВременногоФайла 	= ПолучитьИмяВременногоФайла("docx");
		#КонецЕсли
		
		Макет = УправлениеПечатьюMSWordКлиент.ПолучитьМакетMSWord(ДвоичныеДанныеМакета, ИмяВременногоФайла);
		Документ = УправлениеПечатьюMSWordКлиент.ИнициализироватьПечатнуюФормуMSWord(Макет);
		
		Если ДанныеДляПечати.ВидСудопроизводства = ПредопределенноеЗначение("Перечисление.энргВидыСудопроизводства.ПриказноеПроизводство") Тогда
			
			Область = УправлениеПечатьюMSWordКлиент.ПолучитьОбластьМакетаMSWord(Макет, "Документ");
			Область_ = УправлениеПечатьюMSWordКлиент.ПрисоединитьОбласть(Документ, Область, , Ложь);
			УправлениеПечатьюMSWordКлиент.ЗаполнитьПараметры(Область_, ДанныеДляПечати);
			
			Для каждого СтрокаНачисления Из ДанныеДляПечати.ТаблицаНачислений Цикл
				
				Область = УправлениеПечатьюMSWordКлиент.ПолучитьОбластьМакетаMSWord(Макет, "Начисления");
				Область_ = УправлениеПечатьюMSWordКлиент.ПрисоединитьОбласть(Документ, Область, , Ложь);
				УправлениеПечатьюMSWordКлиент.ЗаполнитьПараметры(Область_, СтрокаНачисления);
			КонецЦикла;
			
			Если ДанныеДляПечати.СуммаОплат <> 0 Тогда
				//Область = УправлениеПечатьюMSWordКлиент.ПолучитьОбластьМакетаMSWord(Макет, "СерединаДокумента");
				//Область_ = УправлениеПечатьюMSWordКлиент.ПрисоединитьОбласть(Документ, Область, , Ложь);
				//
				//Для каждого СтрокаОплаты Из ДанныеДляПечати.ТаблицаОплат Цикл
					
					Область = УправлениеПечатьюMSWordКлиент.ПолучитьОбластьМакетаMSWord(Макет, "Оплаты");
					Область_ = УправлениеПечатьюMSWordКлиент.ПрисоединитьОбласть(Документ, Область, , Ложь);
					УправлениеПечатьюMSWordКлиент.ЗаполнитьПараметры(Область_, ДанныеДляПечати);
				//КонецЦикла;
			КонецЕсли;	
			
			Область  = УправлениеПечатьюMSWordКлиент.ПолучитьОбластьМакетаMSWord(Макет, "КонецДокумента");
			Область_ = УправлениеПечатьюMSWordКлиент.ПрисоединитьОбласть(Документ, Область, , Ложь);
			УправлениеПечатьюMSWordКлиент.ЗаполнитьПараметры(Область_, ДанныеДляПечати);
			
			УправлениеПечатьюMSWordКлиент.ПоказатьДокументMSWord(Документ);
			УправлениеПечатьюMSWordКлиент.ЗакрытьСоединение(Макет, Истина);
			
		Иначе
			
			Область = УправлениеПечатьюMSWordКлиент.ПолучитьОбластьМакетаMSWord(Макет, "Документ");
			Область_ = УправлениеПечатьюMSWordКлиент.ПрисоединитьОбласть(Документ, Область, , Ложь);
			УправлениеПечатьюMSWordКлиент.ЗаполнитьПараметры(Область_, ДанныеДляПечати);
			
			Для каждого СтрокаНачисления Из ДанныеДляПечати.ТаблицаНачислений Цикл
				
				Область = УправлениеПечатьюMSWordКлиент.ПолучитьОбластьМакетаMSWord(Макет, "Начисления");
				Область_ = УправлениеПечатьюMSWordКлиент.ПрисоединитьОбласть(Документ, Область, , Ложь);
				УправлениеПечатьюMSWordКлиент.ЗаполнитьПараметры(Область_, СтрокаНачисления);
				
			КонецЦикла;
			
			Если ДанныеДляПечати.СуммаОплат <> 0 Тогда
					
				Область = УправлениеПечатьюMSWordКлиент.ПолучитьОбластьМакетаMSWord(Макет, "Оплаты");
				Область_ = УправлениеПечатьюMSWordКлиент.ПрисоединитьОбласть(Документ, Область, , Ложь);
				УправлениеПечатьюMSWordКлиент.ЗаполнитьПараметры(Область_, ДанныеДляПечати);

			КонецЕсли;	

			
			Область  = УправлениеПечатьюMSWordКлиент.ПолучитьОбластьМакетаMSWord(Макет, "КонецДокумента");
			Область_ = УправлениеПечатьюMSWordКлиент.ПрисоединитьОбласть(Документ, Область, , Ложь);
			УправлениеПечатьюMSWordКлиент.ЗаполнитьПараметры(Область_, ДанныеДляПечати);
			
			УправлениеПечатьюMSWordКлиент.ПоказатьДокументMSWord(Документ);
			УправлениеПечатьюMSWordКлиент.ЗакрытьСоединение(Макет, Истина);
				
		КонецЕсли;	
		
	КонецЦикла;
	
	
	
	//Макет = УправлениеПечатьюMSWordКлиент.ПолучитьМакетMSWord(ДвоичныеДанныеМакета, ПолучитьИмяВременногоФайла("docx"));
	//Документ = УправлениеПечатьюMSWordКлиент.ИнициализироватьПечатнуюФормуMSWord(Макет);
	//
	////ПрисоединитьОбласть_MS_Word(Макет, Документ, "Документ", ДанныеДляПечати);\
	////Область = УправлениеПечатьюMSWordКлиент.ПолучитьОбластьМакетаMSWord(Макет, "Документ");
	//Область = УправлениеПечатьюMSWordКлиент.ПолучитьОбластьМакетаMSWord(Макет, "Документ");
	//Если Область = Неопределено тогда
	//	Сообщить("При выводе на печать не найдена область """ + "Документ" + """");
	//Иначе
	//	Область_ = УправлениеПечатьюMSWordКлиент.ПрисоединитьОбласть(Документ, Область, , Ложь); 
	//	//Параметры = УправлениеПечатьюMSWordКлиент.ПараметрыОбласти_MS_Word(Область_);
	//	ДанныеДляПечати = Новый Структура("ОрганизацияПолное, ОрганизацияСокращенное", "Тест_Акционерное общество «Русатом Инфраструктурные решения»", "Тест_АО «РИР»");
	//	//ЗаполнитьЗначенияСвойств(Параметры, ДанныеДляПечати);
	//	УправлениеПечатьюMSWordКлиент.ЗаполнитьПараметры(Область_, ДанныеДляПечати);
	//КонецЕсли;
	//
	//УправлениеПечатьюMSWordКлиент.ПоказатьДокументMSWord(Документ);
	//УправлениеПечатьюMSWordКлиент.ЗакрытьСоединение(Макет, Истина);
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьПараметрыПечатиЗаявлениеОВынесенииСудебногоПриказа(Задача)

	Возврат Документы.энргСобытие.ПолучитьПараметрыПечатиЗаявлениеОВынесенииСудебногоПриказа(Задача);

КонецФункции 

&НаКлиенте
Процедура ПараметрыЗначениеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	// Вставить содержимое обработчика.
	Если Элементы.Параметры.ТекущиеДанные.Параметр = ПредопределенноеЗначение("ПланВидовХарактеристик.бестПараметрыТиповСобытий.Суд_СудебныйУчасток") Тогда
		
		//СтандартнаяОбработка = Ложь;
		Элементы.ПараметрыЗначение.ВыбиратьТип = Ложь;
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("Строение",ЗначениеРеквизитаОбъекта(ЭтотОбъект.Основание,"МКД"));
	    //ФормаВыбора = ПолучитьФорму("Документ.энргСобытие.Форма.Форма",ПараметрыФормы,ЭтаФорма);
		ФормаВыбора = ПолучитьФорму("Справочник.энргСудебныеУчастки.Форма.ФормаВыбора",ПараметрыФормы,Элемент);
		//ФормаВыбора.РежимВыбора = Истина;
		ФормаВыбора.Открыть();
		
	КонецЕсли;	
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ЗначениеРеквизитаОбъекта(Ссылка,Реквизит)
	
	Возврат ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Ссылка,Реквизит);
	
КонецФункции	

&НаКлиенте
Процедура ПараметрыЗначениеОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Если Элементы.Параметры.ТекущиеДанные.Параметр = ПредопределенноеЗначение("ПланВидовХарактеристик.бестПараметрыТиповСобытий.Суд_СудебныйУчасток") Тогда
		
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция СудебноеУчреждение(Основание)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1 
			|	отэкСудебныеУчастки.Ссылка КАК Ссылка
			|ИЗ
			|	Справочник.энргСудебныеУчастки.Строения КАК отэкСудебныеУчасткиСтроения
			|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.энргСудебныеУчастки КАК отэкСудебныеУчастки
			|		ПО отэкСудебныеУчасткиСтроения.Ссылка = отэкСудебныеУчастки.Ссылка
			|ГДЕ
			|	отэкСудебныеУчасткиСтроения.Строение = &Строение
			|";
	
	Запрос.УстановитьПараметр("Строение",Основание.Мкд);
	
	Результат = Запрос.Выполнить().Выбрать();
	
	Если Результат.Следующий() Тогда
		
		Возврат Результат.Ссылка;
		
	Иначе
		
		Возврат Неопределено;
		
	КонецЕсли;	
	
КонецФункции	

&НаСервереБезКонтекста
Функция ДополнитьИнформациейОСуде(Ссылка,ДанныеДляПечати)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	энргСобытиеПараметры.Значение КАК Значение,
	               |	ВЫБОР
	               |		КОГДА энргСобытиеПараметры.Значение ССЫЛКА Справочник.энргСуды
	               |			ТОГДА отэкСудыКонтактнаяИнформация.Представление
	               |		ИНАЧЕ отэкСудебныеУчасткиКонтактнаяИнформация.Представление
	               |	КОНЕЦ КАК Адрес
	               |ИЗ
	               |	Документ.энргСобытие.Параметры КАК энргСобытиеПараметры
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.энргСудебныеУчастки.КонтактнаяИнформация КАК отэкСудебныеУчасткиКонтактнаяИнформация
	               |		ПО энргСобытиеПараметры.Значение = отэкСудебныеУчасткиКонтактнаяИнформация.Ссылка
	               |			И (отэкСудебныеУчасткиКонтактнаяИнформация.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Адрес))
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.энргСуды.КонтактнаяИнформация КАК отэкСудыКонтактнаяИнформация
	               |		ПО энргСобытиеПараметры.Значение = отэкСудыКонтактнаяИнформация.Ссылка
	               |			И (отэкСудыКонтактнаяИнформация.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Адрес))
	               |ГДЕ
	               |	энргСобытиеПараметры.Параметр = &Параметр
	               |	И энргСобытиеПараметры.Ссылка = &Ссылка";
			 
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("Параметр", ПланыВидовХарактеристик.бестПараметрыТиповСобытий.Суд_СудебныйУчасток);
	Результат = Запрос.Выполнить().Выбрать();
	
	Если Результат.Следующий() Тогда
		
		
		ДанныеДляПечати.Вставить ("СудДляПечатиАдрес", Результат.Адрес);
		Если ТипЗнч(Результат.Значение) = Тип("СправочникСсылка.энргСудебныеУчастки") Тогда
		    ДанныеДляПечати.Вставить ("СудДляПечати", "Мировому судье " + ПолучитьСклоненияСтроки(Результат.Значение.Наименование, 
                                  ,"ПД=Родительный")[0]);
			ДанныеДляПечати.Вставить ("Судья",Результат.Значение.Судья.Наименование);
		Иначе
			ДанныеДляПечати.Вставить ("СудДляПечати", Результат.Значение.Наименование); 
			Если Результат.Значение.Судьи.Количество() <> 0 Тогда
				ДанныеДляПечати.Вставить ("Судья",Результат.Значение.Судьи[0].Судья.Наименование);
			Иначе
				ДанныеДляПечати.Вставить ("Судья","");
			КонецЕсли;	
		КонецЕсли;	
	Иначе	
		
		ДанныеДляПечати.Вставить ("СудДляПечати", "");
		ДанныеДляПечати.Вставить ("СудДляПечатиАдрес","");
		ДанныеДляПечати.Вставить ("Судья","");
		
	КонецЕсли;	
	
	Возврат ДанныеДляПечати;
	
КонецФункции	

&НаКлиенте
Процедура ФормированиеЗаявления(Команда)
	
	Для каждого ТекСтрокаТЧ Из Объект.Абоненты Цикл
		Если Не ЗначениеЗаполнено(ТекСтрокаТЧ.Основание) Тогда
			Продолжить;
		КонецЕсли;
		
		ДанныеДляПечати = ПолучитьПараметрыПечатиЗаявлениеИсполнительногоДокумента(ТекСтрокаТЧ.Основание);
		ДанныеДляПечати = ДополнитьИнформациейОСуде(Объект.Ссылка,ДанныеДляПечати);
		
		Адрес = ПечатьЗаявленияИсполнительногоДокумента();
		
		Если Адрес = Неопределено Тогда
			Продолжить;
		КонецЕсли;
			
		ДвоичныеДанныеМакета = ПолучитьИзВременногоХранилища(Адрес);
		
		#Если ВебКлиент Тогда
			ВременныйКаталог 	= УправлениеПечатьюСлужебныйКлиент.СоздатьВременныйКаталог("MSWord");
			ИмяВременногоФайла 	= ВременныйКаталог + Строка(Новый УникальныйИдентификатор) + ".tmp";
		#Иначе
			ИмяВременногоФайла 	= ПолучитьИмяВременногоФайла("docx");
		#КонецЕсли
		
		Макет = УправлениеПечатьюMSWordКлиент.ПолучитьМакетMSWord(ДвоичныеДанныеМакета, ИмяВременногоФайла);
		Документ = УправлениеПечатьюMSWordКлиент.ИнициализироватьПечатнуюФормуMSWord(Макет);
		
		Область = УправлениеПечатьюMSWordКлиент.ПолучитьОбластьМакетаMSWord(Макет, "Документ");
		Область_ = УправлениеПечатьюMSWordКлиент.ПрисоединитьОбласть(Документ, Область, , Ложь);
		УправлениеПечатьюMSWordКлиент.ЗаполнитьПараметры(Область_, ДанныеДляПечати);
			
		//Для каждого СтрокаНачисления Из ДанныеДляПечати.ТаблицаНачислений Цикл
		//	
		//	Область = УправлениеПечатьюMSWordКлиент.ПолучитьОбластьМакетаMSWord(Макет, "Начисления");
		//	Область_ = УправлениеПечатьюMSWordКлиент.ПрисоединитьОбласть(Документ, Область, , Ложь);
		//	УправлениеПечатьюMSWordКлиент.ЗаполнитьПараметры(Область_, СтрокаНачисления);
		//КонецЦикла;
		//
		//Если ДанныеДляПечати.СуммаОплат <> 0 Тогда
		//	//Область = УправлениеПечатьюMSWordКлиент.ПолучитьОбластьМакетаMSWord(Макет, "СерединаДокумента");
		//	//Область_ = УправлениеПечатьюMSWordКлиент.ПрисоединитьОбласть(Документ, Область, , Ложь);
		//	//
		//	//Для каждого СтрокаОплаты Из ДанныеДляПечати.ТаблицаОплат Цикл
		//	
		//	Область = УправлениеПечатьюMSWordКлиент.ПолучитьОбластьМакетаMSWord(Макет, "Оплаты");
		//	Область_ = УправлениеПечатьюMSWordКлиент.ПрисоединитьОбласть(Документ, Область, , Ложь);
		//	УправлениеПечатьюMSWordКлиент.ЗаполнитьПараметры(Область_, ДанныеДляПечати);
		//	//КонецЦикла;
		//КонецЕсли;	
		//
		//Область  = УправлениеПечатьюMSWordКлиент.ПолучитьОбластьМакетаMSWord(Макет, "КонецДокумента");
		//Область_ = УправлениеПечатьюMSWordКлиент.ПрисоединитьОбласть(Документ, Область, , Ложь);
		//УправлениеПечатьюMSWordКлиент.ЗаполнитьПараметры(Область_, ДанныеДляПечати);
		
		УправлениеПечатьюMSWordКлиент.ПоказатьДокументMSWord(Документ);
		УправлениеПечатьюMSWordКлиент.ЗакрытьСоединение(Макет, Истина);
			
		
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьПараметрыПечатиЗаявлениеИсполнительногоДокумента(Задача)

	Возврат Документы.энргСобытие.ПолучитьПараметрыПечатиЗаявлениеИсполнительногоДокумента(Задача);

КонецФункции 


&НаСервере
Функция ПечатьЗаявленияИсполнительногоДокумента()
	
	ДвоичныеДанные 	= УправлениеПечатью.МакетПечатнойФормы("Документ.энргСобытие.ПФ_DOC_ЗаявлениеИсполнительногоДокумента");
	Адрес			= ПоместитьВоВременноеХранилище(ДвоичныеДанные, ЭтаФорма.УникальныйИдентификатор);
		
	Возврат Адрес;
	
КонецФункции

#КонецОбласти
